; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph1 - mode
	thermograph2 - mode
	image0 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star4)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
)
(:goal (and
	(have_image Phenomenon5 image0)
	(have_image Planet6 image0)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 image0)
	(have_image Star10 thermograph1)
	(have_image Star11 spectrograph3)
	(have_image Star12 image0)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   goals met: 0 of 8
5. (take_image satellite0 planet6 instrument2 image0)
   added: (have_image planet6 image0)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon7 instrument2 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon5 instrument2 image0)
   added: (have_image phenomenon5 image0)
   goals met: 4 of 8
12. (turn_to satellite0 star10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star10)
   goals met: 4 of 8
13. (take_image satellite0 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 5 of 8
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 5 of 8
15. (take_image satellite0 star11 instrument2 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 6 of 8
16. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 6 of 8
17. (take_image satellite0 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 7 of 8
18. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
19. (take_image satellite0 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 8 of 8
